﻿//*****************************************************************//
//*****************************************************************//
//*****************************************************************//
//**                                                             **//
//**        (C)Copyright 1985-2012, American Megatrends, Inc.    **//
//**                                                             **//
//**                     All Rights Reserved.                    **//
//**                                                             **//
//**   5555 Oakbrook Pkwy, Building 200,Norcross, Georgia 30093  **//
//**                                                             **//
//**                     Phone (770)-246-8600                    **//
//**                                                             **//
//*****************************************************************//
//*****************************************************************//
//*****************************************************************//
// $Archive: $
//
// $Author: $
//
// $Revision: $
//
// $Date: $
//
//*****************************************************************//
//*****************************************************************//
//*****************************************************************//

/=#

//CAUTION: Do not add new string tokens, when TSE source module is
//not present. When TSE source module is not present, usage of this
//file is restricted to only modification of strings; otherwise
//outcome is unpredictable. When you TSE sources and want to add a
//new string add the token in FakeTokens.c

// None Aptio 4.x versions of TSE need to carry VFR.uni with the TSE sources.
#include "VFR.uni"


#string STR_MAIN_TITLE           #language    eng    "Aptio Setup Utility - Copyright (C) %04x American Megatrends, Inc."
                                 #language    fra    "Utilité De Configuration D'Aptio - Copyright (C) %04x American Megatrends, Inc."
                                 #language    chi    "Aptio 設定工具 - 版權所有 (C) %04x American Megatrends, Inc."
#string STR_MAIN_COPYRIGHT       #language    eng    "Version %x.%02x.%04x. Copyright (C) %04x American Megatrends, Inc."
                                 #language    fra    "Version %x.%02x.%04x. Copyright (C) %04x American Megatrends, Inc."
                                 #language    chi    "版本 %x.%02x.%04x. 版權所有 (C) %04x American Megatrends, Inc."

#string STR_CTRL_CHKBOX_ENABLE   #language    eng    "Enabled"
                                 #language    fra    "Activé"
                                 #language    chi    "設定"
#string STR_CTRL_CHKBOX_DISABLE  #language    eng    "Disabled"
                                 #language    fra    "Désactivé"
                                 #language    chi    "取消"
#string STR_HELP_TITLE           #language    eng    "Item Help"
                                 #language    fra    "Aide De Choix"
                                 #language    chi    "項目提示"

#string STR_FDD                     #language eng "FDD"
#string STR_HDD                     #language eng "HDD"
#string STR_CDROM                   #language eng "CD/DVD ROM"
#string STR_NETWORK                 #language eng "Embedded Network"
#string STR_BEV                     #language eng "BEV"

#string STR_PRI_MAS                 #language eng "Primary Master"
#string STR_PRI_SLA                 #language eng "Primary Slave"
#string STR_SEC_MAS                 #language eng "Secondary Master"
#string STR_SEC_SLA                 #language eng "Secondary Slave"
#string STR_SATA_X                  #language eng "SATA %d"
#string STR_NO_BOOT_OPTIONS         #language eng "No option to boot to.\n\r\n\r"

#string STR_PASSWORD_PROMPT         #language    eng    "Enter Password"
                                    #language    fra    "Enter Password"
                                    #language    chi    "輸入密碼"

#string STR_ERROR_PSWD              #language    eng    "Invalid Password"
                                    #language    fra    "Invalid Password"
                                    #language    chi    "密碼錯誤"

#string STR_DRV_HLTH_REBOOT_POST    #language eng "Driver Health requested Rebooting....."

#string STR_EVAL_MSG             #language    eng    "EVALUATION COPY."
                                 #language    fra    "EVALUATION COPY."
                                 #language    chi    "EVALUATION COPY."
#string STR_ACK_BBS_POPUP        #language    eng    "Entering Boot Menu..."
                                 #language    fra    "Entering Boot Menu..."
                                 #language    chi    "Entering Boot Menu..."
#string STR_DEL_ENTER_SETUP      #language    eng    "Press <DEL> or <ESC> to enter setup."
                                 #language    fra    "Press <DEL> or <ESC> to enter setup."
                                 #language    chi    "按 <DEL> 或 <ESC> 進入."
#string STR_ACK_ENTER_SETUP      #language    eng    "Entering Setup..."
                                 #language    fra    "Entering Setup..."
                                 #language    chi    "Entering Setup..."
#string STR_GENERAL_HELP         #language    eng    "General Help"
                                 #language    fra    "Aide générale"
                                 #language    chi    "一般性提示"
#string STR_GENERAL_HELP_MSG     #language    eng    "↑↓→←      : Move\nEnter     : Select\n+/-       : Value\nESC       : Exit\nF1        : General Help\nF2        : Previous Values\nF3        : Optimized Defaults\nF4        : Save & Exit Setup\n<K>       : Scroll help area upwards\n<M>       : Scroll help area downwards"
                                 #language    fra    "↑↓→←      : Move\nEnter     : Select\n+/-       : Value\nESC       : Exit\nF1        : General Help\nF2        : Previous Values\nF3        : Optimized Defaults\nF4        : Save & Exit Setup"
                                 #language    chi    "↑↓→←      : 移動\nEnter     : 選擇\n+/-       : 數值\nESC       : 離開\nF1        : 一般性提示\nF2        : 之前設定值\nF3        : 最佳化預設值\nF4        : 儲存並離開"
#string STR_BOOT_MANAGER         #language    eng    "Boot Manager"
                                 #language    fra    "Boot Manager"
                                 #language    chi    "啟動管理員"
#string STR_BOOT_MANAGER_HELP    #language    eng    "Configure boot options"
                                 #language    fra    "Configure boot options"
                                 #language    chi    "啟動配置選項"
#string STR_LANGUAGE             #language    eng    "Language"
                                 #language    fra    "Langue"
                                 #language    chi    "語言"
#string STR_LANGUAGE_HELP        #language    eng    "Select the default system language"
                                 #language    fra    "Choisissez la langue de système"
                                 #language    chi    "選擇系統預設語言"

#string STR_LOAD_PREVIOUS        #language    eng    "Load Previous Values"
                                 #language    fra    "Load Previous Values"
                                 #language    chi    "載入之前設定值"
#string STR_LOAD_PREVIOUS_MSG    #language    eng    "Load Previous Values?"
                                 #language    fra    "Load Previous Values?"
                                 #language    chi    "載入之前設定值嗎?"

#string STR_LOAD_FAILSAFE        #language    eng    "Load Fail-Safe Defaults"
                                 #language    fra    "Load Fail-Safe Defaults"
                                 #language    chi    "載入安全預設值"
#string STR_LOAD_FAILSAFE_HELP   #language    eng    "Load Fail-Safe Defaults"
                                 #language    fra    "Load Fail-Safe Defaults"
                                 #language    chi    "載入安全預設值"
#string STR_LOAD_FAILSAFE_MSG    #language    eng    "Load Fail-Safe Defaults?"
                                 #language    fra    "Load Fail-Safe Defaults?"
                                 #language    chi    "載入安全預設值嗎?"

#string STR_LOAD_OPTIMAL         #language    eng    "Load Optimized Defaults"
                                 #language    fra    "Load Optimized Defaults"
                                 #language    chi    "載入最佳化預設值"
#string STR_LOAD_OPTIMAL_HELP    #language    eng    "Load Optimized Defaults"
                                 #language    fra    "Load Optimized Defaults"
                                 #language    chi    "載入最佳化預設值"
#string STR_LOAD_OPTIMAL_MSG     #language    eng    "Load Optimized Defaults?"
                                 #language    fra    "Load Optimized Defaults?"
                                 #language    chi    "載入最佳化預設值嗎?"

#string STR_SAVE_EXIT            #language    eng    "Save & Exit Setup"
                                 #language    fra    "Save & Exit Setup"
                                 #language    chi    "儲存並離開"
#string STR_SAVE_EXIT_HELP       #language    eng    "Save Data to NVRAM"
                                 #language    fra    "Save Data to NVRAM"
                                 #language    chi    "儲存資料到 NVRAM 中"
#string STR_SAVE_EXIT_MSG        #language    eng    "Save configuration and exit?"
                                 #language    fra    "Save configuration and exit?"
                                 #language    chi    "儲存配置並離開嗎?"

#string STR_SAVE_RESET           #language    eng    "Save & reset"
                                 #language    fra    "Save & reset"
                                 #language    chi    "儲存並重新啟動"
#string STR_SAVE_RESET_HELP      #language    eng    "Save Data to NVRAM"
                                 #language    fra    "Save Data to NVRAM"
                                 #language    chi    "儲存資料到 NVRAM 中"
#string STR_SAVE_RESET_MSG       #language    eng    "Save configuration and reset?"
                                 #language    fra    "Save configuration and reset?"
                                 #language    chi    "儲存配置並重新啟動嗎?"

#string STR_SAVE_VALUES          #language    eng    "Save Setup Values"
                                 #language    fra    "Save Setup Values"
                                 #language    chi    "儲存設定資料"
#string STR_SAVE_VALUES_MSG      #language    eng    "Save configuration?"
                                 #language    fra    "Save configuration?"
                                 #language    chi    "儲存配置嗎?"

#string STR_EXIT                 #language    eng    "Exit Without Saving"
                                 #language    fra    "Exit Without Saving"
                                 #language    chi    "不儲存並離開"
#string STR_EXIT_MSG             #language    eng    "Quit without saving?"
                                 #language    fra    "Quit without saving?"
                                 #language    chi    "不儲存並離開嗎?"

#string STR_RESET                #language    eng    "Reset Without Saving"
                                 #language    fra    "Reset Without Saving"
                                 #language    chi    "不儲存並重新啟動"
#string STR_RESET_MSG            #language    eng    "Reset without saving?"
                                 #language    fra    "Reset without saving?"
                                 #language    chi    "不儲存並重新啟動嗎?"


#string STR_SAVE_USER_DEFAULTS   #language    eng    "Save Values as User Defaults"
                                 #language    fra    "Save Values as User Defaults"
                                 #language    chi    "資料儲存為使用者預設值"

#string STR_LOAD_USER_DEFAULTS   #language    eng    "Restore User Defaults"
                                 #language    fra    "Restore User Defaults"
                                 #language    chi    "恢復使用者預設值"
#string STR_LOAD_USER_MSG        #language    eng    "Restore User Defaults?"
                                 #language    fra    "Restore User Defaults?"
                                 #language    chi    "恢復使用者預設值嗎?"
				 
#string STR_SUBMENU_OPTION       #language    eng    "Press Enter"
                                 #language    fra    "Allez"
                                 #language    chi    "按 Enter"
#string STR_CTRL_OK              #language    eng    "Ok"
                                 #language    fra    "Ok"
                                 #language    chi    "接受"
#string STR_CTRL_CANCEL          #language    eng    "Cancel"
                                 #language    fra    "Cancel"
                                 #language    chi    "取消"
#string STR_CTRL_YES             #language    eng    "Yes"
                                 #language    fra    "oui"
                                 #language    chi    "是"
#string STR_CTRL_NO              #language    eng    "No"
                                 #language    fra    "no"
                                 #language    chi    "否"
#string STR_DAY_SUNDAY           #language    eng    "Sun"
                                 #language    fra    "dim"
                                 #language    chi    "星期天"
#string STR_DAY_MONDAY           #language    eng    "Mon"
                                 #language    fra    "lun"
                                 #language    chi    "星期一"
#string STR_DAY_TUESDAY          #language    eng    "Tue"
                                 #language    fra    "mar"
                                 #language    chi    "星期二"
#string STR_DAY_WEDNESDAY        #language    eng    "Wed"
                                 #language    fra    "mer"
                                 #language    chi    "星期三"
#string STR_DAY_THURSDAY         #language    eng    "Thu"
                                 #language    fra    "jeu"
                                 #language    chi    "星期四"
#string STR_DAY_FRIDAY           #language    eng    "Fri"
                                 #language    fra    "ven"
                                 #language    chi    "星期五"
#string STR_DAY_SATURDAY         #language    eng    "Sat"
                                 #language    fra    "sam"
                                 #language    chi    "星期六"

#string STR_OLD_PSWD             #language    eng    "Enter Current Password"
                                 #language    fra    "Enter Current Password"
                                 #language    chi    "輸入目前密碼"
#string STR_NEW_PSWD             #language    eng    "Create New Password"
                                 #language    fra    "Create New Password"
                                 #language    chi    "建立新的密碼"
#string STR_CONFIRM_NEW_PSWD     #language    eng    "Confirm New Password"
                                 #language    fra    "Confirm New Password"
                                 #language    chi    "確定新的密碼"
				 
#string STR_PSWD_CLR             #language    eng    "Clear Old Password. Continue?"
#string STR_ERROR                #language    eng    "ERROR"
                                 #language    fra    "ERROR"
                                 #language    chi    "錯誤"
#string STR_WARNING              #language    eng    "WARNING"
                                 #language    fra    "WARNING"
                                 #language    chi    "警告"

#string STR_WARNING_NOT_FOUND    #language    eng    "Not Found"
                                 #language    fra    "Not Found"
                                 #language    chi    "找不到"
#string STR_ERROR_INPUT          #language    eng    "Invalid Input Range"
                                 #language    fra    "Invalid Input Range"
#string STR_EMPTY_STRING         #language    eng    ""
                                 #language    fra    ""
                                 #language    chi    ""

#string STR_INCONSISTENT_MSG_TITLE		#language eng  "Inconsistency error"
										#language fra  "Inconsistency error"
										#language chi  "資料前後不一致錯誤"

#string STR_NOSUBMITIF_MSG_TITLE		#language eng  "Submit error"
#string STR_BBS_POPUP_TITLE_STRING	#language    eng    "Please select boot device:"
                                 	#language    fra    "Please select boot device:"
                                 	#language    chi    "Please select boot device:"

#string STR_BBS_POPUP_HELP1_STRING	#language    eng    "↑ and ↓ to move selection"
                                 	#language    fra    "↑ and ↓ to move selection"
                                 	#language    chi    "↑ and ↓ to move selection"

#string STR_BBS_POPUP_HELP2_STRING	#language    eng    "ENTER to select boot device"
                                 	#language    fra    "ENTER to select boot device"
                                 	#language    chi    "ENTER to select boot device"

#string STR_BBS_POPUP_HELP3_STRING	#language    eng    "ESC to boot using defaults"
                                 	#language    fra    "ESC to boot using defaults"
                                 	#language    chi    "ESC to boot using defaults"

#string STR_BBS_POPUP_HELP_STRING	#language    eng    "↑ and ↓ to move selection\nENTER to select boot device\nESC to boot using defaults"
                                 	#language    fra    "↑ and ↓ to move selection\nENTER to select boot device\nESC to boot using defaults"
                                 	#language    chi    "↑ and ↓ to move selection\nENTER to select boot device\nESC to boot using defaults"

#string STR_POPUPMENU_ENTER_SETUP   #language    eng    "Enter Setup"
				    #language    fra    "Enter Setup"
				    #language    chi    "Enter Setup"
				    
#string STR_USB                     #language eng "USB"
#string STR_VENDOR                  #language eng "Vendor Specific"
#string STR_FILEPATH                #language eng "File Path"
#string STR_PROTOCOL                #language eng "Protocol"
#string STR_FV_FILEPATH             #language eng "Firmware File Path"

#string STR_USB_DP                  #language eng "USB %d"
#string STR_SCSI_DP                 #language eng "SCSI %d LUN %d"
#string STR_FIBRE_CHANNEL_DP        #language eng "Fibre Channel %ld LUN %ld"
#string STR_1394_DP                 #language eng "1394 Device"
#string STR_I20_DP                  #language eng "I20 (Tid: %x)"
#string STR_INFINIBAND_DP           #language eng "InfiniBand Device %ld"
#string STR_VENDOR_DP               #language eng "Vendor Specific Device"
#string STR_MAC_DP                  #language eng "Mac: %a"
#string STR_NETWORK_IPV4_DP         #language eng "Network IPv4 Device %d"
#string STR_NETWORK_IPV6_DP         #language eng "Network IPv6 Device %d"
#string STR_UART_DP                 #language eng "UART Device (Baud Rate: %ld)"
#string STR_USB_CLASS_DP            #language eng "USB %xh - Class Device"
#string STR_USB_CLASS_PHY_DP        #language eng "USB %xh - Physical Device"
#string STR_USB_CLASS_MASS_DP       #language eng "USB %xh - Mass Storage Device"
#string STR_USB_LOGICAL_DP          #language eng "USB Logical Device %d"
#string STR_USB_SATA_DP             #language eng "USB SATA Device %d"
#string STR_USB_ISCSI_DP            #language eng "USB iSCSI Device %ld"

#string STR_HARD_DISK_ORDER         #language eng "Hard Drive BBS Priorities"
#string STR_CDROM_ORDER             #language eng "CD/DVD ROM Drive BBS Priorities"
#string STR_FLOPPY_DISK_ORDER       #language eng "Floppy Drive BBS Priorities"
#string STR_NETWORK_ORDER           #language eng "Network Device BBS Priorities"
#string STR_BEV_ORDER               #language eng "BEV Device BBS Priorities"
#string STR_USB_ORDER               #language eng "USB Device BBS Priorities"
#string STR_PCMCIA_ORDER            #language eng "PCMCIA Device BBS Priorities"
#string STR_UNKNOWN_ORDER           #language eng "Unknown Device BBS Priorities"

#string STR_ADD_BOOT_OPTION_RESERVED	#language eng "Boot Option Name is Reserved"
#string STR_ADD_BOOT_OPTION_EMPTY		#language eng "Please set Boot Option Name and File Path"
#string STR_ADD_DRIVER_OPTION_EMPTY		#language eng "Please set Driver Option Name and File Path"
#string STR_DEL_BOOT_OPTION_RESERVED	#language eng "Reserved Boot Option, can not be Deleted"

#string STR_MSGBOX_PROGRESS_TITLE          #language    eng    "AMI Progress Box"
                                 	   #language    fra    "AMI Progress Box"
                                 	   #language    chi    "AMI Progress Box"

#string STR_MSGBOX_PROGRESS_TEXT          #language    eng    "Message Box for Progress Update"
                                 	  #language    fra    "Message Box for Progress Update"
                                 	  #language    chi    "Message Box for Progress Update"

// EIP-41615: strings related to file browser support in Add Boot Option
#string STR_FILE_SYSTEM                 #language eng "Select a File System"
#string STR_FILE_PATH                   #language eng "Select a File to Boot"
#string STR_DRIVER_PATH                 #language eng "Select a Driver"
#string STR_DRV_HLTH_TITLE         	    #language eng "Driver Health"
#string STR_DRV_HLTH_RECON         	    #language eng "Proceed with Reconnecting the Controller"
#string STR_DRV_HLTH_REBOOT       	    #language eng "Proceed with Sytem Reboot"
#string STR_SECBOOT_VIOLATION       	#language eng "Secure Boot Violation"
#string STR_SECBOOT_INV_SIGN	       	#language eng "Invalid signature detected. Check Secure Boot Policy in Setup"

//#include "StyleStr.uni"

#string STR_DBG_PRINT_CHECKED           #language eng "x"
#string STR_DBG_PRINT_HIIPARSING        #language eng "Print HiiParsing"
#string STR_DBG_PRINT_HIIFUNCTION       #language eng "Print HiiFunctions"
#string STR_DBG_PRINT_HIICALLBACK       #language eng "Print HiiCallbacks"
#string STR_DBG_PRINT_HIINOTIFICATION   #language eng "Print HiiNotifications"
#string STR_DBG_PRINT_IFRFORM           #language eng "Print Current IfrForm"
#string STR_DBG_PRINT_VARIABLE_CACHE    #language eng "Print Variable Cache"

//EIP-96246 Starts
#string STR_OVERRIDE_BOOTNEXT_OPTION_1	#language eng "Override now and clear the BootNext data"
#string STR_OVERRIDE_BOOTNEXT_OPTION_2	#language eng "Override now but keep the BootNext data"
#string STR_OVERRIDE_BOOTNEXT_OPTION_3	#language eng "Boot to BootNext and clear BootNext data"
#string STR_OVERRIDE_OPTION_MENU_TITLE	#language eng "BootNext Override options:"
#string STR_OVERRIDE_OPTION_MENU_LEGEND	#language eng "ENTER to perform the selected action.\n Press ESC to close this menu"
//EIP-96246 Ends

#string STR_OLD_PSWD_LABEL		#language    eng    "Enter Current "
#string STR_NEW_PSWD_LABEL		#language    eng    "Create New "
#string STR_CONFIRM_NEW_PSWD_LABEL	#language    eng    "Confirm New "
#string STR_PSWD_CLR_LABEL		#language    eng    "Clear Old "
#string STR_FILE_SYSTEM_TO_SAVE_IMG    	#language    eng    "Select a File System to print current screen"
#string STR_TSE_CACHE_CHANGE_WARNING    #language    eng    "Changes Happened. Save/Discard the changes and exit"
#string STR_CANT_CHANGE_PASSWORD   	#language    eng    "Change of password not expected by driver"
#string STR_PARSING_ERROR   	#language    eng    "Invalid configuration data detected and excluded."

#string STR_NON_DEVICE_GROUP        #language eng "Non Devices Group"
#string STR_DISK_DEVICE_GROUP       #language eng "Disk Devices Group"
#string STR_VIDEO_DEVICE_GROUP      #language eng "Video Devices Group"
#string STR_NETWORK_DEVICE_GROUP    #language eng "Network Devices Group"
#string STR_INPUT_DEVICE_GROUP      #language eng "Input Devices Group"
#string STR_ONBOARD_DEVICE_GROUP    #language eng "Onboard Devices Group"
#string STR_OTHER_DEVICE_GROUP      #language eng "Other Devices Group"
#string STR_DEVICE_GROUP_HELP       #language eng "Provides Device Group Access"
//**********************************************************************//
//**********************************************************************//
//**********************************************************************//
//**                                                                  **//
//**        (C)Copyright 1985-2013, American Megatrends, Inc.         **//
//**                                                                  **//
//**                       All Rights Reserved.                       **//
//**                                                                  **//
//**     5555 Oakbrook Pkwy, Building 200,Norcross, Georgia 30093     **//
//**                                                                  **//
//**                       Phone: (770)-246-8600                      **//
//**                                                                  **//
//**********************************************************************//
//**********************************************************************//
//**********************************************************************//
